---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneOrigins
source: html/3ab35910-ed41-5748-00cb-4e2235b51595.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneOrigins Method

The plane origins of roof slabs.

## Syntax (C#)
```csharp
public IList<XYZ> GetPlaneOrigins()
```

## Returns
The origins.